tutorials/turbine/KrogstadWindTunnelCase/0.original/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10.0 0.0 0.0);

boundaryField
{
    top
    {
        type            slip;
    }

    ground
    {
        type            slip;
    }

    walls
    {
        type            slip;
    }

    inflow           
    {
        type            fixedValue;
        value           uniform (10.0 0.0 0.0);
    }

    outflow          
    {
        type            inletOutlet;
        inletValue      uniform (0.0 0.0 0.0);
        value           uniform (10.0 0.0 0.0);
    }
}

// ************************************************************************* //
