tutorials/turbine/KrogstadWindTunnelCase/system/decomposeParDict
/*-------------------------------*- C++ -*---------------------------------*\
|    =========                                                              |
|    \\      /     OpenFOAM                                                 |
|     \\    /                                                               |
|      \\  /       The Open Source CFD Toolbox                              |
|       \\/                                        http://www.OpenFOAM.org  |
\*-------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    location    "system";
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 288;
method             scotch;

simpleCoeffs
{
    n           (4 1 1);
    delta       0.001;
}

hierarchicalCoeffs
{
    n           (1 1 3);
    delta       0.001;
    order       xyz;
}

metisCoeffs
{
    processorWeights
    (
        1
        1
        1
        1
    );
}

manualCoeffs
{
    dataFile    "decompositionData";
}



// ************************************************************************* //
